province_list = [('กรุงเทพมหานคร', 'กรุงเทพมหานคร'), ('นนทบุรี', 'นนทบุรี'), ('ปทุมธานี', 'ปทุมธานี'),
                 ('สมุทรปราการ', 'สมุทรปราการ'), ('สมุทรสงคราม', 'สมุทรสงคราม'), ('สมุทรสาคร', 'สมุทรสาคร'),
                 ('กระบี่', 'กระบี่'), ('กาญจนบุรี', 'กาญจนบุรี'), ('กาฬสินธุ์', 'กาฬสินธุ์'), ('กำแพงเพชร', 'กำแพงเพชร'),
                 ('ขอนแก่น', 'ขอนแก่น'), ('จันทบุรี', 'จันทบุรี'), ('ฉะเชิงเทรา', 'ฉะเชิงเทรา'), ('ชลบุรี', 'ชลบุรี'),
                 ('ชัยนาท','ชัยนาท'),('ชัยภูมิ','ชัยภูมิ'),('ชุมพร','ชุมพร'),('เชียงราย','เชียงราย'),('เชียงใหม่','เชียงใหม่'),
                 ('ตรัง','ตรัง'),('ตราด','ตราด'),('ตาก','ตาก'),('นครนายก','นครนายก'),('นครปฐม','นครปฐม'),
                 ('นครพนม','นครพนม'),('นครราชสีมา','นครราชสีมา'),('นครศรีธรรมราช','นครศรีธรรมราช'),('นครสวรรค์','นครสวรรค์'),
                 ('นราธิวาส','นราธิวาส'),('น่าน','น่าน'),('บึงกาฬ','บึงกาฬ'),('บุรีรัมย์','บุรีรัมย์'),('ประจวบคีรีขันธ์','ประจวบคีรีขันธ์'),
                 ('ปราจีนบุรี','ปราจีนบุรี'),('ปัตตานี','ปัตตานี'),('พระนครศรีอยุธยา','พระนครศรีอยุธยา'),('พังงา','พังงา'),('พัทลุง','พัทลุง'),
                 ('พิจิตร','พิจิตร'),('พิษณุโลก','พิษณุโลก'),('เพชรบุรี','เพชรบุรี'),('เพชรบูรณ์','เพชรบูรณ์'),('แพร่','แพร่'),
                 ('พะเยา','พะเยา'),('ภูเก็ต','ภูเก็ต'),('มหาสารคาม','มหาสารคาม'),('มุกดาหาร','มุกดาหาร'),('แม่ฮ่องสอน','แม่ฮ่องสอน'),
                 ('ยะลา','ยะลา'),('ยโสธร','ยโสธร'),('ร้อยเอ็ด','ร้อยเอ็ด'),('ระนอง','ระนอง'),('ระยอง','ระยอง'),('ราชบุรี','ราชบุรี'),
                 ('ลพบุรี','ลพบุรี'),('ลำปาง','ลำปาง'),('ลำพูน','ลำพูน'),('เลย','เลย'),('ศรีสะเกษ','ศรีสะเกษ'),('สกลนคร','สกลนคร'),
                 ('สงขลา','สงขลา'), ('สตูล','สตูล'),('สระแก้ว','สระแก้ว'),('สระบุรี','สระบุรี'),('สิงห์บุรี','สิงห์บุรี'),('สุโขทัย','สุโขทัย'),
                 ('สุพรรณบุรี','สุพรรณบุรี'),('สุราษฎร์ธานี','สุราษฎร์ธานี'),('สุรินทร์','สุรินทร์'),('หนองคาย','หนองคาย'),('หนองบัวลำภู','หนองบัวลำภู'),
                 ('อ่างทอง','อ่างทอง'),('อุดรธานี','อุดรธานี'),('อุทัยธานี','อุทัยธานี'),('อุตรดิตถ์','อุตรดิตถ์'),('อุบลราชธานี','อุบลราชธานี'),
                 ('อำนาจเจริญ','อำนาจเจริญ')]


category_list = [('grains', 'ธัญพืช'), ('rice', 'ข้าว'), ('vegetables', 'ผักผลไม้'), ('oil', 'น้ำมันประกอบอาหาร'),
                 ('bread', 'ขนมปัง'), ('supplements', 'อาหารเสริม'), ('keto', 'คีโต'), ('organic', 'ออร์แกนิก'),
                 ('superfood', 'ซุปเปอร์ฟูด'), ('tea', 'ชา'), ('coffee beans', 'เมล็ดกาแฟ'), ('snacks', 'อาหารทานเล่น'),
                 ('nuts and beans', 'ถั่ว'), ('drinks', 'เครื่องดื่ม'), ('kids', 'อาหารเด็ก'), ('ingredients', 'วัตถุดิบประกอบอาหาร')]
